# Assignment 5: Tidy Data

## Learning Objectives
This lesson meets the following learning objectives:
- The ability to recognize and generate tidy data.

## Instructions
Read through all of the text in this page. This assignment provides step-by-step training divided into numbered sections. The sections often contain embeded exectable code for demonstration.  Section headers with icons have special meanings:  

- <i class="fas fa-puzzle-piece"></i> The puzzle icon indicates that the section provides a practice exercise that must be completed.  Follow the instructions for the exercise and do what it asks.  Exercises must be turned in for credit.
- <i class="fa fa-cogs"></i> The cogs icon indicates that the section provides a task to perform.  Follow the instructions to complete the task.  Tasks are not turned in for credit but must be completed to continue progress.

Review the list of items in the **Expected Outcomes** section to check that you feel comfortable with the material you just learned. If you do not, then take some time to re-review that material again. If after re-review you are not comfortable, do not feel confident or do not understand the material, please ask questions on Slack to help.

Follow the instructions in the **What to turn in** section to turn in the exercises of the assginment for course credit.

## Introduction
The purpose of this assignment is to learn and practice with preparing tidy datasets.  Often data we are asked to analyze is provided to us in formats that are not easy to visualize or analyze.  Many visualization tools such as Seaborn or analytical tools such as supervised machine learning libraries expect data to be tidied.  It is important to know what "tidy" data is, how to reformat a data into a tidy format, and to organize our own scientific data to help ourselves and others analyze it.

**What are "tidy" datasets?**

> Tidy datasets are easy to manipulate, model and visualize, and have a specific structure: each variable is a column, each observation is a row, and each type of observational unit is a table.

\- Wickham, Hadley. [Tidy Data](https://www.jstatsoft.org/article/view/v059i10). *Journal of Statistical Software*, 59.10 (2014): 1 - 23.

Before proceeding, fully read the [Tidy Data paper](https://www.jstatsoft.org/article/view/v059i10) (quoted above) by Hadley Wickham. Once finished, return here to reinforce the techniques introduced by that paper.

## <i class="fa fa-cogs"></i>  Notebook Setup
As before, we import any needed packages at the top of our notebook. Let's import Numpy and Pandas:

In [1]:
import numpy as np
import pandas as pd


## 1. Tidy Rules
### 1.1 Recognizing data components
To understand the rules for tidy data, we should define a few terms: 'variable', 'observation' and 'observational unit'.  

+ **variable**:  
  > A variable is a characteristic of a unit being observed... to which a numerical measure or a category... can be assigned (e.g. income, age, weight, etc., and “occupation”, “industry”, “disease”, etc.
  
  \- [OECD Glossary of Statistical terms -- Variable](https://stats.oecd.org/glossary/detail.asp?ID=2857)
+ **observation**:
  > An observation is the value, at a particular period, of a particular variable
  
  \- [OECD Glossary of Statistical terms -- Observation](https://stats.oecd.org/glossary/detail.asp?ID=6132)
  
+ **observational unit**:
  > Observation units are those entities on which information is received and statistics are compiled.
  
  \- [OECD Glossary of Statistical terms -- Observation Unit](https://stats.oecd.org/glossary/detail.asp?ID=1873)
  
With those definitions for reference, remember from the text that in order for a dataset to be considered "tidy" it must be organized into a table (i.e. Pandas DataFrame) and follow these rules:

+ Each variable forms a unique column in the data frame.
+ Each observation forms a row in the data frame.
+ Each **type** of observational unit needs its own table.

To demonstrate the meaning of these rules, let's first examine a dataset described in the Tidy Data paper. Execute the following lines of code that manually creates a Pandas data frame containing the example table:

In [2]:
# Create the data rows and columns.
data = [['John Smith', None, 2],
        ['Jane Doe', 16, 11],
        ['Mary Johnson', 3, 1]]

# Create the list of labels for the data frame.
headers = ['', 'Treatment_A', 'Treatment_B']

# Create the data frame.
pd.DataFrame(data, columns=headers)

                 Treatment_A  Treatment_B
0    John Smith          NaN            2
1      Jane Doe         16.0           11
2  Mary Johnson          3.0            1

This data is not in tidy format.  Can you see why?

### 1.2. <i class="fas fa-puzzle-piece"></i> Practice

In the cell below notebook, perform the following.

Using the table above, answer the following:

- What are the variables?
- What are the observations?
- What is the observable unit?
- Are the variables columns?
- Are the observations rows?

### 1.3 Spotting messy data
The author provides a few useful indicators that help us spot untidied data:
1. Column headers are values, not variable names.
2. Multiple variables are stored in one column.
3. Variables are stored in both rows and columns.
4. Multiple types of observational units are stored in the same table.
5. A single observational unit is stored in multiple tables.

As an example, let's look at a data set that the author borrowed from the Pew Reserach Center that provides religious affiliation and yearly income ranges for individuals surveyed. Execute the following code which manually puts that data into a Pandas data frame:

In [3]:
data = [['Agnostic',27,34,60,81,76,137],
        ['Atheist',12,27,37,52,35,70],
        ['Buddhist',27,21,30,34,33,58],
        ['Catholic',418,617,732,670,638,1116],
        ['Don\'t know/refused',15,14,15,11,10,35],
        ['Evangelical Prot',575,869,1064,982,881,1486],
        ['Hindu',1,9,7,9,11,34],
        ['Historically Black Prot',228,244,236,238,197,223],
        ['Jehovah\'s Witness',20,27,24,24,21,30],
        ['Jewish',19,19,25,25,30,95]]
headers = ['religion','<$10k','$10-20k','$20-30k','$30-40k','$40-50k','$50-75k']
religion = pd.DataFrame(data, columns=headers)
religion

                  religion  <$10k  $10-20k  $20-30k  $30-40k  $40-50k  $50-75k
0                 Agnostic     27       34       60       81       76      137
1                  Atheist     12       27       37       52       35       70
2                 Buddhist     27       21       30       34       33       58
3                 Catholic    418      617      732      670      638     1116
4       Don't know/refused     15       14       15       11       10       35
5         Evangelical Prot    575      869     1064      982      881     1486
6                    Hindu      1        9        7        9       11       34
7  Historically Black Prot    228      244      236      238      197      223
8        Jehovah's Witness     20       27       24       24       21       30
9                   Jewish     19       19       25       25       30       95

As another example, consider the data frame also provided by the author. For this data,  the demographic groups are broken down by sex (m, f) and age (0–14, 15–25, 25–34, 35–44, 45–54, 55–64, 65+, or unknown). Execute the following:

In [4]:
data = [['AD', 2000, 0, 0, 1, 0, 0, 0, 0, None, None],
        ['AE', 2000, 2, 4, 4, 6, 5, 12, 10, None, 3],
        ['AF', 2000, 52, 228, 183, 149, 129, 94, 80, None, 93],
        ['AG', 2000, 0, 0, 0, 0, 0, 0, 1, None, 1],
        ['AL', 2000, 2, 19, 21, 14, 24, 19, 16, None, 3],
        ['AM', 2000, 2, 152, 130, 131, 63, 26, 21, None, 1],
        ['AN', 2000, 0, 0, 1, 2, 0, 0, 0, None, 0],
        ['AO', 2000, 186, 999, 1003, 912, 482, 312, 194, None, 247],
        ['AR', 2000, 97, 278, 594, 402, 419, 368, 330, None, 121],
        ['AS', 2000, None, None, None, None, 1, 1, None, None, None]]
headers = ['country', 'year', 'm014', 'm1524', 'm2534', 'm3544', 'm4554', 'm5564', 
           'm65', 'mu', 'f014']
demographics = pd.DataFrame(data, columns=headers)
demographics

  country  year   m014  m1524   m2534  m3544  m4554  m5564    m65    mu   f014
0      AD  2000    0.0    0.0     1.0    0.0      0      0    0.0  None    NaN
1      AE  2000    2.0    4.0     4.0    6.0      5     12   10.0  None    3.0
2      AF  2000   52.0  228.0   183.0  149.0    129     94   80.0  None   93.0
3      AG  2000    0.0    0.0     0.0    0.0      0      0    1.0  None    1.0
4      AL  2000    2.0   19.0    21.0   14.0     24     19   16.0  None    3.0
5      AM  2000    2.0  152.0   130.0  131.0     63     26   21.0  None    1.0
6      AN  2000    0.0    0.0     1.0    2.0      0      0    0.0  None    0.0
7      AO  2000  186.0  999.0  1003.0  912.0    482    312  194.0  None  247.0
8      AR  2000   97.0  278.0   594.0  402.0    419    368  330.0  None  121.0
9      AS  2000    NaN    NaN     NaN    NaN      1      1    NaN  None    NaN

### 1.4. <i class="fas fa-puzzle-piece"></i> Practice

Using the religious affiliation data, answer the following.


Using the data set above:

- Explain why the data above is untidy?
- What are the variables?  
- What are the observations?

### 1.5. <i class="fas fa-puzzle-piece"></i> Practice

Using the demographic dataframe, respond to the following.


Using the data set above:

- Explain why the data above is untidy?
- What are the variables?  
- What are the observations?

## 2. Melting and Pivoting Data
In the Tidy paper, the author indicated that many times a data set can be corrected, or tidied, by first "melting" the data. Fortunately, Pandas provides the `pd.melt` function! See the [online documenation for pd.melt](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.melt.html) for full usage instructions.  The author provides five different use cases where melting (and other transformations) can be performed:

1. Column headers are values, not variable names.
2. Multiple variables are stored in one column.
3. Variables are stored in both rows and columns.
4. Multiple types of observational units are stored in the same table.
5. A single observational unit is stored in multiple tables.

We will explore only a few of these use cases.  However, the techniques provided by these examples will help with melting for all of them.

### 2.1 Use Case #1: column headers are values
To demonsrate melting let's create a sample dataframe that provides the progress level of different groups of individuals in a process that has two stages:

In [5]:
df = pd.DataFrame({'Group': {0: 'A', 1: 'B', 2: 'C'},
                   'Stage1': {0: 1, 1: 3, 2: 5},
                   'Stage2': {0: 2, 1: 4, 2: 6}})
df

  Group  Stage1  Stage2
0     A       1       2
1     B       3       4
2     C       5       6

It's clear that this dataset does not follow tidy rules.  This is because information about the stage is housed in the header (i.e. two different stages: stage1 and stage2). To tidy this up, we should have a separate column that indicates the stage and a corresponding column that indicates the observation for each stage.

The first step to correct this is to melt the data. To melt a dataset using Pandas, you must indicate which columns in the current data frame should be kept as columns and which columns should be melted (also called **unpivoted**) to rows.  This is indicated using two arguments provided to `pd.melt`:

- `id_vars`: indicates the columns to use as identifier variables.  These columns remain as columns in the dataframe after melting.
- `value_vars`: indicates the columns to melt (unpivot). If not specified, then all columns that are not set as `id_vars` are used.  
  - The column header becomes a value in a new column
  - The value within the original column is matched with the header value in an adjacent column.

As an example, let's melt the example dataframe:

In [6]:
df2 = pd.melt(df, id_vars=['Group'], value_vars=['Stage1', 'Stage2'])
df2

  Group variable  value
0     A   Stage1      1
1     B   Stage1      3
2     C   Stage1      5
3     A   Stage2      2
4     B   Stage2      4
5     C   Stage2      6

Observe that the new column labels named 'variable' and 'value' are not proper names for the data the colomn contains.  We can either set these manually using:

```python
df2.columns = ['Group', 'Stage', 'Level']
```

Or, we can provide the new labels when we melt the data using the `var_name` and `value_name` arguments:

In [7]:
df2 = pd.melt(df, id_vars=['Group'], value_vars=['Stage1', 'Stage2'],
             var_name='Stage', value_name='Level')
df2

  Group   Stage  Level
0     A  Stage1      1
1     B  Stage1      3
2     C  Stage1      5
3     A  Stage2      2
4     B  Stage2      4
5     C  Stage2      6

### 2.2. <i class="fas fa-puzzle-piece"></i> Practice

In the cell below notebook, perform the following.

Using the `pd.melt` function, melt the demographics data introduced in section 2. Be sure to:
- Set the column headers correctly. 
- Order by country 
- Print the first 10 lines of the resulting melted dataset.

### 2.3 Use Case #2: multiple variables stored in one column
Sometimes, melting the data is not enough.  Suppose we melted the demographic data such that the columns headers indicating sex and age are now in a new variable with a column header of `age` and the observation in a new column named `freq` (for frequency):

<table>
    <tr><th>country</th><th>year</th><th>age</th><th>freq</th></tr>
    <tr><td>AD</td><td>2000</td><td>m014</td><td>0</td></tr>
    <tr><td>AD</td><td>2000</td><td>m5564</td><td>0</td></tr>
    <tr><td>AD</td><td>2000</td><td>m3544</td><td>0</td></tr>
    <tr><td>AD</td><td>2000</td><td>m65</td><td>0</td></tr>
    <tr><td>AD</td><td>2000</td><td>m2534</td><td>1</td></tr>
    <tr><td>AD</td><td>2000</td><td>mu</td><td>None</td></tr>
    <tr><td>AD</td><td>2000</td><td>m1524</td><td>0</td></tr>
    <tr><td>AD</td><td>2000</td><td>f014</td><td>NaN</td></tr>
    <tr><td>AD</td><td>2000</td><td>m4554</td><td>0</td></tr>
    <tr><td>AE</td><td>2000</td><td>m5564</td><td>12</td></tr>
</table>

Notice that the `age` column contains both the sex ('m' or 'f') and the age range. We need to split that `age` column into three different columns corresponding to the sex, minimum age and maximum age.  To do this, we can use the following line of code:

```Python
temp_df = melted_df["age"].str.extract("(\D)(\d+)(\d{2})")    

```
Remember, that Pandas provides a [pandas.Series.str.extract](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.extract.html) function for manipulating the string values of a Series, and each column in a Pandas dataframe is a series. We can use this function to break apart the value into three separate columns.

Observe the argument provided to the `.str.extract` function: `(\D)(\d+)(\d{2})`. This type of string is called a regular expression (RE).  We will not cover regular expressions in detail, but they are a powerful method for parsing strings to either match elements of the string or to split them.  An [introduction to REs](https://docs.python.org/3.4/howto/regex.html#regex-howto) for Python and [a full syntax description](https://docs.python.org/3.4/library/re.html#regular-expression-syntax) is available online.  But here is a short explanation for the elements of the RE above:

+ `(\D)`: Matches any single character which is not a digit.  This correspondes to the sex: 'f' or 'm'.
+ `(\d+)`: Matches one or more digits.  This correspondes to the minimum age which may be one or more digits.
+ `(\d{2})`: Matches exactly two digits.  This requires that the last two digits are the max age.

Let's try it and see how it works:

In [8]:
# Melt the demographics dataset and sort by country:
melted_df = pd.melt(demographics, id_vars=["country", "year"],
                    var_name="age", value_name="freq")
melted_df = melted_df.sort_values(by=["country"])

# Split 'age' column into a new dataframe containing the three components: sex, 
# minimum age and maximum age.
temp_df = melted_df["age"].str.extract("(\D)(\d+)(\d{2})")
temp_df.columns = ['sex', 'min_age', 'max_age']
temp_df.head(10)

    sex min_age max_age
0     m       0      14
50    m      55      64
30    m      35      44
60  NaN     NaN     NaN
20    m      25      34
70  NaN     NaN     NaN
10    m      15      24
80    f       0      14
40    m      45      54
51    m      55      64

### 2.4 Use Case #3: variables are in both rows and columns

Consider the following dataset which contains the daily weather records for five months in 2010 for the MX17004 weather station in Mexico. Each day of the month has it's own column (e.g. d1, d2, d3, etc.).  The example data only provides the first 8 days:

In [9]:
data = [['MX17004',2010,1,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,1,'tmin',None,None,None,None,None,None,None,None],
        ['MX17004',2010,2,'tmax',None,27.3,24.1,None,None,None,None,None],
        ['MX17004',2010,2,'tmin',None,14.4,14.4,None,None,None,None,None],
        ['MX17004',2010,3,'tmax',None,None,None,None,32.1,None,None,None],
        ['MX17004',2010,3,'tmin',None,None,None,None,14.2,None,None,None],
        ['MX17004',2010,4,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,4,'tmin',None,None,None,None,None,None,None,None],
        ['MX17004',2010,5,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,5,'tmin',None,None,None,None,None,None,None,None]]
headers = ['id','year','month','element','d1','d2','d3','d4','d5','d6','d7','d8']
weather = pd.DataFrame(data, columns=headers)
weather

,id,year,month,element,d1,d2,d3,d4,d5,d6,d7,d8
0,MX17004,2010,1,tmax,None,NaN,NaN,None,NaN,None,None,None
1,MX17004,2010,1,tmin,None,NaN,NaN,None,NaN,None,None,None
2,MX17004,2010,2,tmax,None,27.3,24.1,None,NaN,None,None,None
3,MX17004,2010,2,tmin,None,14.4,14.4,None,NaN,None,None,None
4,MX17004,2010,3,tmax,None,NaN,NaN,None,32.1,None,None,None
5,MX17004,2010,3,tmin,None,NaN,NaN,None,14.2,None,None,None
6,MX17004,2010,4,tmax,None,NaN,NaN,None,NaN,None,None,None
7,MX17004,2010,4,tmin,None,NaN,NaN,None,NaN,None,None,None
8,MX17004,2010,5,tmax,None,NaN,NaN,None,NaN,None,None,None
9,MX17004,2010,5,tmin,None,NaN,NaN,None,NaN,None,None,None

In this dataset there are two problems.  First, we have a violation of use case #1 where observations are stored in the column labels for the days (e.g. d1, d2, d3, etc.). Second, we have a violation of use case #3. Observe that the `element` column contains values that should be variables.  We want the min and max temperatures for each day as columns.  

First, let's deal with the first problem by including `id`, `year`, `month` and `element` as `id_vars`.  Observe that we will currently not try to tidy the `element` column. We will later want to remove the 'd' from the day so let's name the column `temp_day`:

In [10]:
melted_weather = pd.melt(weather, id_vars=['id', 'year', 'month', 'element'],
        var_name='temp_day', value_name='temperature')
melted_weather.head(10)

        id  year  month element temp_day temperature
0  MX17004  2010      1    tmax       d1        None
1  MX17004  2010      1    tmin       d1        None
2  MX17004  2010      2    tmax       d1        None
3  MX17004  2010      2    tmin       d1        None
4  MX17004  2010      3    tmax       d1        None
5  MX17004  2010      3    tmin       d1        None
6  MX17004  2010      4    tmax       d1        None
7  MX17004  2010      4    tmin       d1        None
8  MX17004  2010      5    tmax       d1        None
9  MX17004  2010      5    tmin       d1        None

Now, let's create an actual date for the measurement rather than storing year, month and day separately.  Let's add a new column to the dataframe named 'day' that uses a regular expression to remove the letter 'd' from the beginning of the day.

In [11]:
melted_weather["day"] = melted_weather["temp_day"].str.extract("d(\d+)", expand=False)  
melted_weather.head(10)

        id  year  month element temp_day temperature day
0  MX17004  2010      1    tmax       d1        None   1
1  MX17004  2010      1    tmin       d1        None   1
2  MX17004  2010      2    tmax       d1        None   1
3  MX17004  2010      2    tmin       d1        None   1
4  MX17004  2010      3    tmax       d1        None   1
5  MX17004  2010      3    tmin       d1        None   1
6  MX17004  2010      4    tmax       d1        None   1
7  MX17004  2010      4    tmin       d1        None   1
8  MX17004  2010      5    tmax       d1        None   1
9  MX17004  2010      5    tmin       d1        None   1

We can now combine the year, month and day to form a proper date. In the code below we construct a string that represents the date in a format compatible with the `pd.to_datetime()` function.  Execute the code below and observe the in-line comments for the meaning of each line of code:

In [31]:
melted_weather["date"] = pd.to_datetime(
    melted_weather['year'].astype(str) + "-" 
    + melted_weather['month'].astype(str) + "-" 
    + melted_weather['day'].astype(str))

melted_weather.head()

        id  year  month element temp_day  temperature  day       date
0  MX17004  2010      1    tmax       d1          NaN    1 2010-01-01
1  MX17004  2010      1    tmin       d1          NaN    1 2010-01-01
2  MX17004  2010      2    tmax       d1          NaN    1 2010-02-01
3  MX17004  2010      2    tmin       d1          NaN    1 2010-02-01
4  MX17004  2010      3    tmax       d1          NaN    1 2010-03-01

Now that we have our date corrected, and properly melted, we can address the second problem: the `element` column containing variable names.  To fix this we need to do the opposite of melting and we need to **pivot**.  To do this we can use the [pd.pivot](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pivot.html) function.  This function takes the following arguments:

- `index`: indicates the columns to use to make the new frame’s index. If None, uses existing index
- `columns`: indicates the column to use whose values will become the new frame’s columns.
- `values`: indicates the columns to use for populating new frame’s values.

Let's use the `pivot_table` function, which is a generalization of the `pivot` function that handles duplicate values or one index/column pair. This will move the `element` column values to be new columns in our data frame.  But first, we will also want to drop unwanted columns:

In [32]:
# Remove unwanted columns
weather_min = melted_weather.drop(['year', 'month', 'day', 'temp_day'], axis=1)
weather_min.head(10)

        id element  temperature       date
0  MX17004    tmax          NaN 2010-01-01
1  MX17004    tmin          NaN 2010-01-01
2  MX17004    tmax          NaN 2010-02-01
3  MX17004    tmin          NaN 2010-02-01
4  MX17004    tmax          NaN 2010-03-01
5  MX17004    tmin          NaN 2010-03-01
6  MX17004    tmax          NaN 2010-04-01
7  MX17004    tmin          NaN 2010-04-01
8  MX17004    tmax          NaN 2010-05-01
9  MX17004    tmin          NaN 2010-05-01

In [33]:
# Unpivot and reset indexes. The pivot_table function automatically removes rows with null values.
weather_tidy = weather_min.pivot_table(index=["id","date"], columns="element", values="temperature")
weather_tidy.reset_index(drop=False, inplace=True)
weather_tidy

element       id       date  tmax  tmin
0        MX17004 2010-02-02  27.3  14.4
1        MX17004 2010-02-03  24.1  14.4
2        MX17004 2010-03-05  32.1  14.2

The weather data is now tidy (although rather small).  

Observe, that in the code above, we called the function `reset_index()` on the Tidy'ed weather data.  If we do not do this, then the row indexes are not incremental within the data frame.

### 2.5. <i class="fas fa-puzzle-piece"></i> Practice

In the cell below notebook, perform the following.

Download the [PI_DataSet.txt](https://hivdb.stanford.edu/download/GenoPhenoDatasets/PI_DataSet.txt) file from [HIV Drug Resistance Database](https://hivdb.stanford.edu/pages/genopheno.dataset.html). Store the file in the same directory as the practice notebook for this assignment.

Here is the meaning of data columns:
- SeqID:  a numeric identifier for a unique HIV isolate protease sequence.  Note: disruption of the protease inhibits HIV’s ability to reproduce.
- The Next 8 columns are identifiers for unique protease inhibitor class drugs.  
  - The values in these columns are the fold resistance over wild type (the HIV strain susceptible to all drugs).
  - Fold change is the ratio of the drug concentration needed to inhibit the isolate.
- The latter columns, with P as a prefix, are the positions of the amino acids in the protease. 
  - '-' indicates consensus.
  - '.' indicates no sequence.
  - '#' indicates an insertion. 
  - '~' indicates a deletion;.
  - '*' indicates a stop codon
  - a letter indicates one letter Amino Acid substitution. 
  - two and more amino acid codes indicates a mixture. 

Import this dataset into your notebook, view the top few rows of the data and respond to these questions:

- What are the variables?  
- What are the observations?   
- What are the values?

### 2.6. <i class="fas fa-puzzle-piece"></i> Practice

In the cell below notebook, perform the following.

Use the data retreived from task 3b, generate a data frame containing a Tidy’ed set of values for drug concentration fold change. Be sure to:

- Remove the all columns but the SeqID and the protease inhibitors.
- Set the column names as ‘SeqID’, ‘Drug’ and ‘Fold_change’.
- Order the data frame first by sequence ID and then by Drug name
- Reset the row indexes
- Display the first 10 elements.

## Expected Outcomes
At this point, you should feel comfortable with the following:
- Know the Tidy rules.
- Spotting untidy data.
- Melting and pivoting data.

## What to Turn in?
Be sure to **commit** and **push** your changes to this notebook.  All practice exercises should be completed.  Once completed, send a **Slack message** to the instructor indicating you have completed this assignment. The instructor will verify all work is completed.